In [109]:
from flask import Flask, jsonify, request
import os
import pickle
import pandas as pd
from sklearn.model_selection import train_test_split 
from sklearn.linear_model import Lasso
from sklearn.preprocessing import StandardScaler, minmax_scale, LabelEncoder
from sklearn.metrics import mean_squared_error, mean_absolute_percentage_error
import numpy as np
import subprocess

In [92]:
sal= pd.read_csv('data/ds_salaries.csv')

In [93]:
sal.drop(['Unnamed: 0'], axis=1, inplace=True)

In [94]:
for col in sal.columns:
    print(f"col:{col}", sal[col].unique())
    print(f"col:{col}", sal[col].nunique())
    print(f"col:{col}", sal[col].isnull().sum())

col:work_year [2020 2021 2022]
col:work_year 3
col:work_year 0
col:experience_level ['MI' 'SE' 'EN' 'EX']
col:experience_level 4
col:experience_level 0
col:employment_type ['FT' 'CT' 'PT' 'FL']
col:employment_type 4
col:employment_type 0
col:job_title ['Data Scientist' 'Machine Learning Scientist' 'Big Data Engineer'
 'Product Data Analyst' 'Machine Learning Engineer' 'Data Analyst'
 'Lead Data Scientist' 'Business Data Analyst' 'Lead Data Engineer'
 'Lead Data Analyst' 'Data Engineer' 'Data Science Consultant'
 'BI Data Analyst' 'Director of Data Science' 'Research Scientist'
 'Machine Learning Manager' 'Data Engineering Manager'
 'Machine Learning Infrastructure Engineer' 'ML Engineer' 'AI Scientist'
 'Computer Vision Engineer' 'Principal Data Scientist'
 'Data Science Manager' 'Head of Data' '3D Computer Vision Researcher'
 'Data Analytics Engineer' 'Applied Data Scientist'
 'Marketing Data Analyst' 'Cloud Data Engineer' 'Financial Data Analyst'
 'Computer Vision Software Engineer' 'Director of Data Engineering'
 'Data Science Engineer' 'Principal Data Engineer'
 'Machine Learning Developer' 'Applied Machine Learning Scientist'
 'Data Analytics Manager' 'Head of Data Science' 'Data Specialist'
 'Data Architect' 'Finance Data Analyst' 'Principal Data Analyst'
 'Big Data Architect' 'Staff Data Scientist' 'Analytics Engineer'
 'ETL Developer' 'Head of Machine Learning' 'NLP Engineer'
 'Lead Machine Learning Engineer' 'Data Analytics Lead']
col:job_title 50
col:job_title 0
col:salary [   70000   260000    85000    20000   150000    72000   190000 11000000
   135000   125000    45000  3000000    35000    87000     8000  4450000
   100000   423000    56000   299000   450000    42000    98000   115000
   325000   720000   157000    51999    60000    41000    65000   103000
   250000    10000   138000    45760    44000   106000    88000    14000
   188000   105000    61500    91000   300000    48000   130000    34000
   118000   120000   138350   110000   130800    19000   412000    40000
    55000    43200   190200    80000    37000   235000   400000   270000
    67000   140000    68000    50000   170000    75000  1450000   276000
  2200000    12000    81000    62000    73000    37456  2250000    82500
    38400   225000    90000   200000     8760   151000   700000    24000
  7000000  8500000   220000   240000    53000   153000   160000   168000
    95000    13400   144000   159500   230000    54000   165000    51400
   174000    58000 30400000   420000  1672000    76760    22000     4000
    59000    74000   152000    21844    18000   120500   147000     9272
  1799997  4000000    52000   195000    32000    69600    21000   435000
   185000   180000  2500000    40900   416000  1200000   256000    39600
  1600000  1335000    52500    31000   108000   600000  2100000    93000
  1250000  4900000    21600    93150   111775    72500   102000    65720
   112000    69999   109000   155000   120600   102100    84900   136620
    99360   146000   123000    99000   116000   106260   126500   242000
    30000   165220   120160    90320   181940   132320   220110   160080
   124190   115500   112900   165400   167000   243900   136600   109280
   128875    93700   224000   167875   175000   156600   108800    95550
   113000   161342   137141   211500   192400    90700    61300   138600
   136000   189650   164996   132000   208775   147800   136994   101570
  6000000    28500   164000   145000   105400   215300   158200   209100
   154600   115934    81666   183600    63900   112300   241000   159000
    82900   100800   140400  1400000  2400000   148000   104890   185100
   324000   216000   210000    29000    52800    66500    57000   121000
   152500   380000   405000   177000    78000   214000   192600   266400
   213120   141300   206699    99100   110500    99050   205300   176000
   200100    70500   184700   175100   140250   116150    69000   150075
    25000   110925   192564   144854   150260   154000   126000   129000]
col:salary 272
col:salary 0
col:salary_currency ['EUR' 'USD' 'GBP' 'HUF' 'INR' 'JPY' 'CNY' 'MXN' 'CAD' 'DKK' 'PLN' 'SGD'
 'CLP' 'BRL' 'TRY' 'AUD' 'CHF']
col:salary_currency 17
col:salary_currency 0
col:salary_in_usd [ 79833 260000 109024  20000 150000  72000 190000  35735 135000 125000
  51321  40481  39916  87000  85000   8000  41689 114047   5707  56000
  43331   6072  47899  98000 115000 325000  42000  33511 100000 117104
  59303  70000  68428 450000  46759  74130 103000 250000  10000 138000
  45760  50180 106000 112872  15966  76958 188000 105000  70139  91000
  45896  54742  60000 148261  38776 118000 120000 138350 110000 130800
  21669 412000  45618  62726  49268 190200  91237  42197  82528 235000
  53192   5409 270000  80000  79197 140000  54238  47282 153667  28476
  59102 170000  88654  76833  19609 276000  29751  89294  12000  95746
  75000  36259  62000  73000  51519 187442  30428  94564 113476 103160
  45391 225000  50000  40189  90000 200000 110037  10354 151000   9466
  40570  49646  38400  24000  63711  77364 220000 240000  82500  82744
  62649 153000 160000 168000  75774  13400 144000 127221 119059 423000
 230000  28369  63831 130026 165000  55000  60757 174000   2859  40038
  81000   5679  22611  90734  26005  61896   4000  69741  74000 152000
  21844  18000  96113 147000   9272  24342  54094  61467 195000  37825
  12901  24823  56738  66022   5882 185000  28609  46597 116914  33808
  56256 416000  87738  71786  16228 256000 180000  63810  46809  21637
 103691  18053  72212  36643  12103  96282 600000  28399  93000  99703
 173762 141846 130000  16904  66265  25532  93150 111775  28016  65013
  72500  18907  77684  58000  20171 112000  69999  94665 102839 109000
  51064 155000 120600 102100  84900 136620  99360 117789 104702 146000
 123000  52351  99000 116000 106260 126500 242000  65438  39263  78526
 165220  45807 120160  90320 181940 132320 220110 160080 124190 115500
 112900 165400 167000 243900 136600 109280 128875  93700 224000 167875
 175000 156600 108800  95550 113000 161342 137141 211500 192400  90700
  61300 138600 136000 189650 164996  54957 118187 132000 208775 147800
 136994 101570  79039  37300 164000 124333  98158 145000 105400  87932
 215300 158200 209100 154600 115934  81666 183600  71982  65949  49461
  58894  63900 112300 241000 159000  82900 100800 140400  43966  32974
  76940  91614  21983  78791 196979  37236  18442  31615  58255 162674
 104890 183228 185100  65000 324000 216000 210000  31875  35590  58035
  93427  52396  62651  40000  87425  86703  64849 157000  70912  71444
  48000 152500  68147 122346 380000  69336 405000 177000  78000 214000
 192600 266400 213120 141300 206699  99100 110500  99050 205300 176000
 200100  70500 184700 175100 140250 116150  54000  69000 150075  25000
 110925 192564 144854 150260  67000  52000 154000 126000 129000]
col:salary_in_usd 369
col:salary_in_usd 0
col:employee_residence ['DE' 'JP' 'GB' 'HN' 'US' 'HU' 'NZ' 'FR' 'IN' 'PK' 'PL' 'PT' 'CN' 'GR'
 'AE' 'NL' 'MX' 'CA' 'AT' 'NG' 'PH' 'ES' 'DK' 'RU' 'IT' 'HR' 'BG' 'SG'
 'BR' 'IQ' 'VN' 'BE' 'UA' 'MT' 'CL' 'RO' 'IR' 'CO' 'MD' 'KE' 'SI' 'HK'
 'TR' 'RS' 'PR' 'LU' 'JE' 'CZ' 'AR' 'DZ' 'TN' 'MY' 'EE' 'AU' 'BO' 'IE'
 'CH']
col:employee_residence 57
col:employee_residence 0
col:remote_ratio [  0  50 100]
col:remote_ratio 3
col:remote_ratio 0
col:company_location ['DE' 'JP' 'GB' 'HN' 'US' 'HU' 'NZ' 'FR' 'IN' 'PK' 'CN' 'GR' 'AE' 'NL'
 'MX' 'CA' 'AT' 'NG' 'ES' 'PT' 'DK' 'IT' 'HR' 'LU' 'PL' 'SG' 'RO' 'IQ'
 'BR' 'BE' 'UA' 'IL' 'RU' 'MT' 'CL' 'IR' 'CO' 'MD' 'KE' 'SI' 'CH' 'VN'
 'AS' 'TR' 'CZ' 'DZ' 'EE' 'MY' 'AU' 'IE']
col:company_location 50
col:company_location 0
col:company_size ['L' 'S' 'M']
col:company_size 3
col:company_size 0

In [95]:
sal.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [111]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    int64
 2   employment_type     607 non-null    int64
 3   job_title           607 non-null    object
 4   salary              607 non-null    int64
 5   salary_currency     607 non-null    object
 6   salary_in_usd       607 non-null    int64
 7   employee_residence  607 non-null    object
 8   remote_ratio        607 non-null    int64
 9   company_location    607 non-null    object
 10  company_size        607 non-null    int64
dtypes: int64(7), object(4)
memory usage: 52.3+ KB

In [97]:
sal.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [98]:
sal.describe().T

,count,mean,std,min,25%,50%,75%,max
work_year,607.0,2021.405272,6.921330e-01,2020.0,2021.0,2022.0,2022.0,2022.0
salary,607.0,324000.062603,1.544357e+06,4000.0,70000.0,115000.0,165000.0,30400000.0
salary_in_usd,607.0,112297.869852,7.095726e+04,2859.0,62726.0,101570.0,150000.0,600000.0
remote_ratio,607.0,70.922570,4.070913e+01,0.0,50.0,100.0,100.0,100.0

In [9]:
X_train, X_test, Y_train_y, Y_test_y = train_test_split(sal.drop('salary', axis=1), sal['salary'], test_size=0.2, random_state=42)

In [99]:
sal["work_year"] = sal["work_year"].map({2020: 0, 2021: 1, 2022: 2})
sal["experience_level"]= sal["experience_level"].map({'MI': 0, 'SE': 1, 'EN' : 2, 'EX':3})
sal["company_size"] = sal["company_size"].map({'S': 0, 'M': 1, 'L': 2})
sal["employment_type"]= sal["employment_type"].map({"FT": 0, "CT": 1, 'PT':2 , 'FL': 3})
sal["remote_ratio"] = sal["remote_ratio"].apply(lambda x: 1 if x == 50 else 2)

In [123]:
sal

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,-2.032024,-1.088876,-0.169238,0.095406,-0.164605,-1.378378,-0.457904,-1.446366,0.441454,-1.491261,1.240346
1,-2.032024,0.148854,-0.169238,1.899208,-0.041475,0.679021,2.083282,-0.460527,0.441454,-0.429997,-1.820182
2,-2.032024,0.148854,-0.169238,-1.328648,-0.154885,-1.149778,-0.046177,-1.117753,-2.265240,-1.116697,-0.289918
3,-2.032024,-1.088876,-0.169238,2.468830,-0.197008,0.679021,-1.301826,-0.953447,0.441454,-0.991843,-1.820182
4,-2.032024,0.148854,-0.169238,1.614397,-0.112761,0.679021,0.531774,0.799156,-2.265240,0.756121,1.240346
...,...,...,...,...,...,...,...,...,...,...,...
602,0.859977,0.148854,-0.169238,-0.379279,-0.110169,0.679021,0.588192,0.799156,0.441454,0.756121,-0.289918
603,0.859977,0.148854,-0.169238,-0.379279,-0.128314,0.679021,0.193263,0.799156,0.441454,0.756121,-0.289918
604,0.859977,0.148854,-0.169238,-0.853963,-0.126370,0.679021,0.235577,0.799156,0.441454,0.756121,-0.289918
605,0.859977,0.148854,-0.169238,-0.853963,-0.112761,0.679021,0.531774,0.799156,0.441454,0.756121,-0.289918
606,0.859977,-1.088876,-0.169238,-1.898270,-0.080359,0.679021,1.237005,-0.734371,0.441454,0.756121,1.240346

In [112]:
cl_cat= sal.select_dtypes(include='object').columns
for column in cl_cat:
    label = LabelEncoder()
    sal[column] = label.fit_transform(sal[column])

In [117]:
for col in sal.columns:
    Stand= StandardScaler()
    sal[col]= Stand.fit_transform(sal[col].values.reshape(-1,1))#usamos reshape pq fit_transfor estpara una matriz no una serie panda

In [119]:
sal.to_csv('data/ds_salaries_clean_scal.csv', index=False)

In [129]:
X_train, X_test, y_train, y_test = train_test_split(sal.drop('salary', axis=1), sal['salary'], test_size=0.2, random_state=42)

In [131]:
print(X_train.shape, X_test.shape, y_train.shape, y_test.shape)

(485, 10) (122, 10) (485,) (122,)

In [130]:
y_train

9     -0.128962
227   -0.161365
591   -0.116096
516   -0.111141
132   -0.185084
         ...
71    -0.185991
106   -0.057677
270   -0.162985
435   -0.164605
102    6.918609
Name: salary, Length: 485, dtype: float64

In [133]:
#guardamos el modelo en pickle
lasso = Lasso(alpha=0.1)#alpha es el parametro de regularizacion
lasso.fit(X_train, Y_train_y)#entrenamos el modelo
pickle.dump(lasso, open('data/model_salary.pkl', 'wb'))#guardamos el modelo en un archivo pickle

In [134]:
y_train.dtype

dtype('float64')